IdeaRS.OpenModel.Detail.Hanging
Representing hanging in IDEA StatiCa Detail

IdeaRS.OpenModel.Detail.Hanging.#ctor
Constructor

IdeaRS.OpenModel.Detail.Hanging.MasterComponent
Master component of hanging

IdeaRS.OpenModel.Detail.Hanging.MasterEdge
Master edge of hanging

IdeaRS.OpenModel.Detail.Hanging.EdgeOrientationType
Edge orientation type

IdeaRS.OpenModel.Detail.Hanging.PositionOnEdge
Position on edge

IdeaRS.OpenModel.Detail.Hanging.Diameter
Diameter o reinforcement

IdeaRS.OpenModel.Detail.Hanging.EndsType
End type of the reinforcement bar - same for both ends

IdeaRS.OpenModel.Detail.Hanging.DiameterOfMandrel
Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars

IdeaRS.OpenModel.Detail.Hanging.HangingType
Type of hanging

IdeaRS.OpenModel.Detail.Hanging.UpperLength
Length of upper part of hanging

IdeaRS.OpenModel.Detail.Hanging.BottomLength
Length of inside part of anchor

IdeaRS.OpenModel.Detail.Hanging.LegsLength
Length of legs

IdeaRS.OpenModel.Detail.Hanging.Angle
Angle between braches

IdeaRS.OpenModel.Detail.Hanging.Radius
Radius of top loop